{
    "code": "E101a",
    "names": "Riboflavin-5'-Phosphate",
    "display_name": "E101a (Riboflavin-5'-Phosphate)",
    "type": "color (Yellow-orange)",
    "status": "e",
    "icon": "mdi-check-circle",
    "more_info": {
        "banned_in": "Approved in the EU. Approved in the US.",
        "overview": "Riboflavin is vitamin B2. It is widely found in both plant- and animal-based foods, including milk, meat, eggs, nuts, enriched flour, and green vegetables.\nRiboflavin is involved in many body processes. It's required for the proper development of the skin, lining of the digestive tract, blood cells, and brain function.\nPeople most commonly use riboflavin to prevent riboflavin deficiency, for migraine, and for high levels of homocysteine in the blood. It's also used for acne, muscle cramps, and many other conditions, but there is no good scientific evidence to support these other uses.\n\nRiboflavin 5-Phosphate is mainly taken in the Ophthalmic Route. Riboflavin 5-Phosphate eye drops is a photoenhancer used in combination with the KXL® System in corneal collagen cross-linking for the treatment of progressive keratoconus and corneal ectasia following refractive surgery. Keratoconus is a degenerative eye disease that cause progressive thinning and distortion of the cornea.\nThis medicine is to be given only by or under the supervision of your doctor.",
        "origin": "Natural colour present in many foods such as milk, eggs, liver and vegetables. Commercially prepared from yeasts. It is also manufactured synthetically.",
        "daily_intake": "Riboflavin is an important nutrient that is found in many foods. The amount that should be consumed on a daily basis is called the recommended dietary allowance (RDA). For adult males, the RDA is 1.3 mg daily. For adult females, the RDA is 1.1 mg daily. During pregnancy, the RDA is 1.4 mg, and during breastfeeding, the RDA is 1.6 mg. Recommended amounts for children depend on age.\nRiboflavin is also available in supplements. Taking riboflavin supplements with food will increase how much the body absorbs. Speak with a healthcare provider to find out what dose might be best for a specific condition.",
        "side_effects": "No data were provided on the effects of riboflavin 5'-phosphate ester monosodium salt on the respiratory system. The dusting potential of the product (Section 3.1.3.2) indicates a risk of exposure by inhalation for people handling the additive.\nNo data were provided on the potential skin and eye irritation or skin sensitisation of the product under assessment.\nPhotoallergenic skin reaction has been shown with riboflavin on guinea pigs (Joshi and Pathak, 1987). In addition, riboflavin is a recognised photosensitiser inducing oxidative damage to light-exposed tissues; therefore, it may elicit skin and eye photoallergic reactions (Cardoso et al., 2012).\nNo side effects known in the concentrations used in foods.",
        "uses": "Effective for\nRiboflavin deficiency (ariboflavinosis). Taking riboflavin by mouth can increase levels of riboflavin in the body, helping to treat and prevent riboflavin deficiency.\nPossibly Effective for\nHigh levels of homocysteine in the blood (hyperhomocysteinemia). Taking riboflavin by mouth for 12 weeks decreases levels of homocysteine by up to 40% in some people with a specific gene type.\nMigraine. Taking high-dose riboflavin by mouth seems to modestly reduce the number and severity of migraine headaches in adults. It's unclear if it helps children.\nThere is interest in using riboflavin for a number of other purposes, but there isn't enough reliable information to say whether it might be helpful.",
        "interactions": "Moderate Interaction\nBe cautious with this combination\nAntibiotics (Tetracycline antibiotics) interacts with RIBOFLAVIN\nRiboflavin might decrease the amount of tetracyclines that the body can absorb. Taking riboflavin along with tetracyclines might decrease the effects of tetracyclines. To avoid this interaction, take riboflavin 2 hours before or 4 hours after taking tetracyclines.",
        "precautions": "When taken by mouth: Riboflavin is likely safe for most people in doses of up to 400 mg daily. In some people, riboflavin can cause the urine to turn a bright yellow color. It may also cause nausea.\nPregnancy and breast-feeding: Riboflavin is likely safe when consumed in amounts commonly found in foods. The recommended intake is 1.4 mg daily during pregnancy and 1.6 mg daily during lactation.\nChildren: Riboflavin is likely safe for most children when consumed in amounts commonly found in foods. Higher doses of 100-200 mg daily have also been safely used.\nLiver disease: Riboflavin absorption is decreased in people with liver disease.",
        "other": "Following a request from the European Commission, the Panel on Additives and Products or Substances used in Animal Feed (FEEDAP) was asked to deliver a scientific opinion on vitamin B2 in the form of riboflavin 5'-phosphate ester monosodium salt as an additive for all animal species for use in water for drinking. \nThe additive under assessment is obtained from a source of riboflavin produced by Ashbya gossypii. \nNo information was provided on the identity and characterisation of the production strain, and on whether or not it is a genetically modified microorganism. Therefore, in the absence of adequate information, it is not possible to perform an assessment of the safety of the production strain. \nRiboflavin 5'-phosphate ester monosodium salt ‘per se’ is considered safe for the target animals, consumers and the environment. \nIn the absence of data regarding the identity and characterisation of the production strain, the FEEDAP Panel cannot conclude on the safety for the target species, consumers, users and the environment of the riboflavin 5'-phosphate ester monosodium salt under assessment. \nSimilarly, in the absence of data, no conclusion can be reached on the safety of the product for the users. Riboflavin 5'-phosphate ester monosodium salt is regarded as effective in covering the animal's requirement when administered via water for drinking.",
        "articles": {
            "FAO": "https://www.fao.org/gsfaonline/additives/details.html?id=136",
            "EU": "https://ec.europa.eu/food/food-feed-portal/screen/food-additives/search/details/POL-FAD-IMPORT-2986",
            "Wikipedia": "https://en.wikipedia.org/wiki/Flavin_mononucleotide",
            "PubChem": "https://pubchem.ncbi.nlm.nih.gov/compound/riboflavin-5_-phosphate-sodium-anhydrous",
            "PubMed": "https://pubmed.ncbi.nlm.nih.gov/6030496/",
            "MayoClinic": "https://www.mayoclinic.org/drugs-supplements/riboflavin-5-phosphate-ophthalmic-route/description/drg-20235484",
            "Drugs.com": "https://www.drugs.com/cdi/riboflavin-5-phosphate.html",
            "EFSA": "https://efsa.onlinelibrary.wiley.com/doi/full/10.2903/j.efsa.2018.5531"
        }
    }
}